reddit_clone/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Star Wars"], ["description", "A long time ago, in a forum far, far away"], ["user_id", 1], ["created_at", "2022-07-11 21:12:37.935177"], ["updated_at", "2022-07-11 21:12:37.935177"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = params[:user_id]
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["title", "Star Wars123"], ["updated_at", "2022-07-11 21:23:47.908310"], ["id", 1]]
---
    def update
        # @sub = Sub.moderator.subs.find_by(id: params[:id])
        @sub = Sub.find(params[:id])
        if @sub && @sub.update(sub_params) && @sub.user_id == current_user.id